---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel
source: html/bd059b90-2d32-1f6e-3d03-e6a28570157e.htm
---
# EnergyAnalysisDetailModel Properties

The id of the assembly instance to which the element belongs.